tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"                   # allow tiling window manager installation (i.e. yabai and skhd)
0-

###############################################################################
# Command-Line Tools                                                          #
###############################################################################

brew "skhd"                                  # manipulate yabai with keyboard
brew "yabai"                                 # tiling window management
brew "libtool"                               # common dependency
brew "pkg-config"                            # common dependency
brew "icu4c"                                 # common dependency
brew "autoconf"                              # common dependency
brew "automake"                              # common dependency
brew "openssl@1.1"                           # common dependency
brew "readline"                              # common dependency
brew "cmake"                                 # common dependency
brew "make"                                  # common dependency
cask "gfortran"                              # common dependency
brew "node"                                  # common dependency
brew "glib"                                  # common dependency
brew "coreutils"                             # GNU extension (i.e. more recent) for 'ls'
brew "moreutils"                             # GNU extension for some other useful utilities like 'sponge'
brew "findutils"                             # GNU extension for 'find', 'locate', 'updatedb', and 'xargs', invoke with 'g' pref (e.g. gfind)
brew "grep"                                  # GNU extension for global regular expression, print
brew "gcc"                                   # GNU compiler collection
brew "gnupg"                                 # encryption and signing
brew "gnupg@1.4"                             # encryption and signing
brew "gsl"                                   # GNU scientific library
brew "libpng"                                # library for manipulating PNG images
brew "pgplot"                                # device-independent graphics package for making simple scientific graphs
brew "ffmpeg"                                # play, record, convert, and stream audio, video, images
brew "cfitsio"                               # C access to flexible image transport system (FITS) data files with optional Fortran wrappers
brew "libheif"                               # imagemagick dependency
brew "imagemagick"                           # tools and libraries to manipulate images in many formats
brew "tesseract"                             # optical character recognition engine
brew "youtube-dl"                            # streaming content downloader including--but not exclusively--YouTube
brew "zsh-autosuggestions"                   # populates remaining shell command from history
brew "zsh-completions"                       # populates available shell commands
brew "zsh-syntax-highlighting"               # colorizes shell commands, arguments, brackets, etc for clarity
brew "fdupes"                                # identify or delete duplicate files
brew "jdupes"                                # duplicate file finder and an enhanced fork of 'fdupes'
brew "docker"                                # docker containers
brew "exiftool"                              # reading and writing metadata
brew "fzf"                                   # fuzzy finder
brew "fasd"									 # Google's "I'm Feeling Lucky" but for cd, based on frequently- and recently-accesed directories
brew "fd"                                    # 'find' alternative with intuitive sytnax, colorized output, default regex matching, Unicode support
brew "ripgrep"                               # 'grep' complement that can ignore .gitignore folders, uses multiple CPUs, though less portable 
brew "tldr"                                  # 'man' complement with command examples, though less verbose and extensive
brew "git"                                   # track file changes
brew "handbrake"                             # open-source video transcoder
brew "htop"                                  # improved top (interactive process viewer)
brew "pandoc"                                # swiss-army knife of text doucment format conversion
brew "rsync"                                 # fast incremental file transfer
brew "tmux"                                  # terminal multiplier
brew "tree"                                  # directory structure mapping
brew "watch"                                 # execute and monitor every [n] seconds
brew "wdiff"                                 # display word differences between text files
brew "wget"                                  # internet file retriever
brew "write-good"                            # flag English prose errors and suspicious constructs
brew "jq"                                    # write queries over JSON documents, for data wrangling
brew "pup"                                   # write queries over HTML documents, for data wrangling
brew "arduino-cli"                           # arduino command line interface
brew "mas"                                   # mac app store commmand-line interface
brew "pinentry-mac"                          # used for automatic git commit signing
brew "terminal-notifier"                     # send macOS notifications from the command-line

###############################################################################
# GUI Tools                                                                   #
###############################################################################

cask "arduino"                               # electronic prototyping
cask "adobe-creative-cloud"                  # Illustrator+InDesign, Lightroom Classic+Photoshop, Premiere+After Effects
cask "autodesk-fusion360"                    # mechanical computer aided design
cask "kicad"                                 # electronic CAD
cask "dymo-label"                            # labeling software
cask "fujitsu-scansnap-home"                 # scanner software for paperless office
cask "google-chrome"                         # secondary browser for web development and extension availability
cask "logitech-options"                      # keyboard and mouse drivers
cask "ltspice"                               # electrical schematic simulation, capture, and waveform viewer
cask "microsoft-office"                      # "updates are available" alert system
cask "microsoft-auto-update"                 # alert system for the alert system
cask "preform"                               # SLA 3D printing
cask "skype"                                 # video messaging application
cask "spotify"                               # music streaming
cask "teamviewer"                            # desktop remote access
cask "papers"                                # paper management
cask "backblaze"                             # cloud backup
cask "visual-studio-code"                    # heavyweight, fully featured editor
cask "nova"                                  # lightweight and native (i.e. smooth) editor
cask "superduper"                            # bootable computer clone backup
cask "mactex"                                # LateX and TeX typesetting
cask "transmission"                          # torrent client
cask "lulu"                                  # network diagnostic tool
cask "bartender"                             # minimalist menu bar
cask "aerial"                                # cinematic screensaver
cask "nightowl"                              # fixes macOS bug preventing automatic system wide darkmode mode at sunset
cask "alfred"                                # spotlight search alternative with faster index access
cask "xquartz"                               # open-source version of the X.Org X Window System
mas "Dark Reader for Safari", id: 1438243180 # browser extension dark mode
mas "Wipr", id: 1320666476                   # browwer extension ad blocker
mas "Instapaper Save", id: 148130243         # browser extension read later service helper
mas "Instapaper", id: 1481302432             # read later service GUI
mas "1Password 7", id: 1333542190            # password management
mas "Deliveries", id: 290986013              # package delivery management
mas "Pastebot", id: 1179623856               # clipboard management
mas "Fantastical", id: 975937182             # calendar with natural language entry, weather, 14-week view, etc
mas "Backtrack", id: 1477089520              # notetaking
mas "Notability", id: 736189492              # notetaking app with synchronous handwriting and audio
mas "Keynote", id: 409183694                 # better PowerPoint
mas "Pages", id: 409201541                   # better Word
mas "Numbers", id: 409203825                 # worse Excel
mas "Slack", id: 803453959                   # team communication 
mas "Telegram", id: 747648890                # instant messaging with sync across devices
mas "The Unarchiver", id: 425424353          # deflate and decompress files
mas "Xcode", id: 497799835                   # Apple's developer tools
cask "keyboardcleantool"
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434