cask_args appdir: '/Applications'            # Encourage installations to act sensibly

tap "homebrew/core"                          # Allow installation of core formulae
tap "homebrew/cask"                          # Allow installation of GUI applications
tap "homebrew/cask-drivers"                  # Allow installation of GUI application drivers
tap "homebrew/bundle"                        # Allow `Brewfile` creation

###############################################################################
# Command-Line Tools                                                          #
###############################################################################

brew "xz"                                    # Common dependency
brew "sqlite"                                # Common dependency
brew "openssl@1.1"                           # Common dependency
brew "readline"                              # Common dependency
brew "webp"                                  # Format for the web images
brew "gnupg"                                 # Encrypt and sign data
brew "libpng"                                # Manipulate PNG images
brew "ffmpeg"                                # Play, record, convert, and stream audio, video, images
brew "imagemagick"                           # Manipulate images in many formats
brew "tesseract"                             # Convert images of text to editable and searchable text
brew "youtube-dl"                            # Download video content, including--but not exclusively--YouTube
brew "zsh-autosuggestions"                   # Populate remaining shell command from history
brew "zsh-completions"                       # Populate available shell commands
brew "zsh-syntax-highlighting"               # Colorize shell commands, arguments, brackets, etc for clarity
brew "shellcheck"                            # Check shell scripts for errors
cask "virtualbox"                            # Virtualize development environment 
cask "vagrant"                               # Automate VM management and deployment
brew "exiftool"                              # Read and write metadata
brew "fzf"                                   # Fuzzily find character strings
brew "fasd"                                  # Google's "I'm Feeling Lucky" but for cd, based on frequently- and recently-accessed directories
brew "git"                                   # Track code changes
brew "git-lfs"                               # Store large files with git
brew "handbrake"                             # Transcode video
brew "pandoc"                                # Convert between text formats
brew "tmux"                                  # Separate projects into sessions, and keeps background processes (e.g. ssh connections) running
brew "tree"                                  # Map directory structure
brew "watch"                                 # Execute and monitor every [n] seconds
brew "write-good"                            # Flag English prose errors and suspicious constructs
brew "jq"                                    # Query over JSON documents
brew "pup"                                   # Query over HTML documents
brew "mas"                                   # Install Mac App Store apps through CLI
brew "pinentry-mac"                          # Automatically sign git commits
brew "terminal-notifier"                     # Send macOS notifications from the command-line
brew "duti"                                  # Set default document and URL handlers
brew "wget"                                  # Download internet files
brew "python@3.9"                            # Default language of choice
brew "fdupes"                                # Identify or delete duplicate files
brew "jdupes"                                # 'fdupes' alternative that's supposedly more fully featured and faster
brew "fd"                                    # 'find' alternative file search that's generally faster with better defaults (e.g. syntax, color, omits .gitignore matches)
brew "ripgrep"                               # 'grep' alternative string search that's generally faster with better defaults (e.g. omits .gitignore matches)
brew "bat"                                   # 'cat' alternative with syntax highlights, line numbers, git integration, and paging 
brew "tldr"                                  # 'man' complement with command examples
brew "rsync"                                 # 'cp' and 'scp' complement for large files: fast, resumable, and incremental transfer
brew "htop"                                  # 'top' alternative (interactive process viewer)

###############################################################################
# GUI Tools                                                                   #
###############################################################################

cask "google-chrome"                         # 'Safari' complement for web development and wider extension availability
cask "alfred"                                # 'Spotlight' alternative with faster search
cask "docker"                                # Containerize development environment
cask "arduino"                               # Prototype electronic designs
cask "imageoptim"                            # Optimally compress images for the web
cask "autodesk-fusion360"                    # Design mechanical components
cask "kicad"                                 # Design electronic circuits
cask "dymo-label"                            # Create physical labels
cask "fujitsu-scansnap-home"                 # Scan documents
cask "logitech-options"                      # Keyboard and mouse drivers
cask "ltspice"                               # Simulate electrical circuits
cask "preform"                               # Print 3D models with resin
cask "3dconnexion"                           # 3D mouse driver
cask "paintbrush"                            # Quickly make simple images
cask "backblaze"                             # Backup computer to cloud
cask "nova"                                  # Lightweight and native (i.e. smooth) code editor
cask "visual-studio-code"                    # Heavyweight, fully featured code editor
cask "carbon-copy-cloner"                    # Create bootable computer clone
cask "mactex"                                # Typeset LaTeX and TeX documents
cask "transmission"                          # Download torrents
cask "bartender"                             # Remove menu bar clutter, but with organic notifications (e.g. display wi-fi and battery when not connected)
cask "aerial"                                # Display a cinematic screensaver
cask "nightowl"                              # Fix macOS bug preventing automatic, system-wide dark mode at sunset
cask "xquartz"                               # Allow applications to create and manage windows
cask "keyboardcleantool"                     # Disable all keyboard and Touch Bar input
cask "raspberry-pi-imager"                   # Fetch and flash OS distributions to μSD cards
cask "zoom"                                  # Meet virtually
cask "skype"                                 # Meet virtually
cask "canon-eos-webcam-utility"              # Record with Canon camera for video conferencing
cask "imageoptim"                            # Optimally compress images for the web to speed up page loads
cask "optimus-player"                        # Play more video formats than QuickTime; nicer UI and color reproduction than VLC
cask "papers"                                # Manage research papers
mas "Paprika Recipe Manager 3", id: 1303222628 # Manage recipes
mas "1Password 7", id: 1333542190            # Manage passwords
mas "Dark Reader for Safari", id: 1438243180 # Add dark mode to web pages
mas "AdGuard for Safari", id: 1440147259       # Block browser ads
mas "Deliveries", id: 290986013              # Track package deliveries 
mas "Pastebot", id: 1179623856               # Copy several items at once
mas "Fantastical", id: 975937182             # Schedule events with natural language entry, weather, 14-week view, etc
mas "Notability", id: 736189492              # Take notes with synchronous handwriting and audio
mas "Keynote", id: 409183694                 # Better PowerPoint
mas "Pages", id: 409201541                   # Better Word
mas "Numbers", id: 409203825                 # Worse Excel
mas "The Unarchiver", id: 425424353          # Deflate and decompress files
mas "Xcode", id: 497799835                   # Develop for Apple hardware
