tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
cask "xquartz"
brew "ack"
brew "arduino-cli"
brew "autoconf"
brew "automake"
brew "openssl@1.1"
brew "readline"
brew "autopep8"
brew "libpng"
brew "glib"
brew "cfitsio"
brew "cmake"
brew "docker"
brew "exiftool"
brew "fdupes"
brew "libtool"
brew "pkg-config"
brew "icu4c"
brew "tesseract"
brew "ffmpeg"
brew "gcc"
brew "git"
brew "gnupg"
brew "gnupg@1.4"
brew "grep"
brew "gsl"
brew "handbrake"
brew "htop"
brew "libheif"
brew "imagemagick"
brew "jdupes"
brew "make"
brew "mas"
brew "node"
brew "numpy"
brew "pandoc"
brew "pgplot"
brew "pinentry-mac"
brew "poetry"
brew "pyenv"
brew "qpdf"
brew "rsync"
brew "scipy"
brew "terminal-notifier"
brew "tldr"
brew "tmux"
brew "tree"
brew "watch"
brew "wdiff"
brew "wget"
brew "write-good"
brew "youtube-dl"
brew "zlib"
cask "aerial"
cask "alfred"
cask "arduino"
cask "backblaze"
cask "bartender"
cask "dymo-label"
cask "gfortran"
cask "google-chrome"
cask "intel-power-gadget"
cask "keyboardcleantool"
cask "kicad"
cask "logitech-options"
cask "ltspice"
cask "mactex-no-gui"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "nova"
cask "papers"
cask "preform"
cask "rocket"
cask "skype"
cask "spotify"
cask "superduper"
cask "teamviewer"
cask "transmission"
cask "visual-studio-code"
mas "1Password 7", id: 1333542190
mas "Backtrack", id: 1477089520
mas "Dark Reader for Safari", id: 1438243180
mas "Fantastical", id: 975937182
mas "Instapaper", id: 1481302432
mas "Keynote", id: 409183694
mas "Notability", id: 736189492
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pastebot", id: 1179623856
mas "Slack", id: 803453959
mas "Telegram", id: 747648890
mas "The Unarchiver", id: 425424353
mas "Wipr", id: 1320666476
mas "Xcode", id: 497799835
